# tap
tap 'homebrew/core'
tap 'homebrew/bundle'

tap 'caskroom/cask'
tap 'caskroom/versions'

# essentials
brew 'zsh'
brew 'git'
brew 'mas'
brew 'vim'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'watch'
brew 'httpie'
brew 'gnupg'
brew 'pinentry-mac'
brew 'git-flow'
brew 'terminal-notifier'

# dev environment
brew 'nvm'
brew 'rbenv'
brew 'ruby-build'

# apps
cask 'atom'
cask 'flux'
cask 'gitup'
cask 'slack'
cask 'firefox'
cask 'licecap'
cask 'macdown'
cask 'overkill'
cask 'grammarly'
cask 'spectacle'
cask 'appcleaner'
cask 'the-unarchiver'
cask 'visual-studio-code'

# quicklook enhancement
cask 'qlcolorcode'
cask 'quicklook-csv'
cask 'quicklook-json'
